export const engLayout = [
  ['`', 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, '-', '=', 'back'],
  ['tab', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\'', 'del'],
  ['caps lock', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', '\'', 'enter'],
  ['shift', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/', '&#x25B2', 'shift'],
  ['ctrl', 'win', 'alt', ' ', 'alt', '&#x25C0', '&#x25BC', '&#x25B6', 'ctrl'],
];

export const engLayoutShift = [
  ['~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+', 'back'],
  ['tab', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|', 'del'],
  ['caps lock', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'enter'],
  ['shift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', '&#x25B2', 'shift'],
  ['ctrl', 'win', 'alt', ' ', 'alt', '&#x25C0', '&#x25BC', '&#x25B6', 'ctrl'],
];

export const rusLayout = [
  ['ё', 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, '-', '=', 'back'],
  ['tab', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\', 'del'],
  ['caps lock', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'enter'],
  ['shift', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.', '&#x25B2', 'shift'],
  ['ctrl', 'win', 'alt', ' ', 'alt', '&#x25C0', '&#x25BC', '&#x25B6', 'ctrl'],
];

export const rusLayoutShift = [
  ['ё', '!', '"', '№', ';', '%', ':', '?', '*', '(', ')', '_', '+', 'back'],
  ['tab', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\', 'del'],
  ['caps lock', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'enter'],
  ['shift', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', ',', '&#x25B2', 'shift'],
  ['ctrl', 'win', 'alt', ' ', 'alt', '&#x25C0', '&#x25BC', '&#x25B6', 'ctrl'],
];
